<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Const
    |--------------------------------------------------------------------------
    */


    // 0:仮登録 1:本登録 2:メール認証済 9:退会済
    'USER_STATUS' => ['PRE_REGISTER' => '0', 'REGISTER' => '1', 'MAIL_AUTHED' => '2', 'DEACTIVE' => '9'],
    
    // 権限レベル(数値低いほど高) 1:特権管理者 3:支部 5:法人 10:個人
    'AUTH_STATUS' => ['ADMIN' => '1','AREA' => '3','COMPANY'=> '5', 'USER' => '10'],
    
    // 権限表示view用（$user->role_id)
    'AUTH_STATUS_JP' => ['1'=>'特権','2'=>'支部','3'=>'法人','4'=>'個人'],

    // 地区名
    'AREA_NAME' => ['阪神','東播磨','西播磨','但馬','丹波','淡路'],

    // 支部名
    'BRANCH_NAME' => [
        '尼崎','芦屋','伊丹','宝塚','川西','三田','猪名川','明石','加古川','西脇',
        '三木','高砂','小野','加西','加東','東播磨','多可','たつの','宍粟','神崎',
        'はりま南西','豊岡','養父','朝来','美方','篠山','丹波','洲本','淡路','南あわじ'
    ],

    // 設置主体
    'COMPANY_VARIATION' => ['市町','社会福祉法人','学校法人','宗教法人','財団法人','株式会社','有限会社','NPO'],

    // こども園類型
    'CATEGORY' => ['幼保','保','特定認可外保育施設型'],


    // 職種
    'JOB' => ['保育士','調理師','施設長','看護師','事務員'],

    // 保育士番号所持状況
    'CHILDMINDER_STATUS' => ['保育士番号あり','保育士番号取得中',],

    // 都道府県
    'PREF' => [
        '北海道','青森県','岩手県','宮城県','秋田県','山形県','福島県','茨城県','栃木県','群馬県','埼玉県','千葉県','東京都','神奈川県','新潟県',
        '富山県','石川県','福井県','山梨県','長野県','岐阜県','静岡県','愛知県','三重県','滋賀県','京都府','大阪府','奈良県','和歌山県','鳥取県',
        '島根県','岡山県','広島県','山口県','徳島県','香川県','愛媛県','高知県','福岡県','佐賀県','長崎県','熊本県','大分県','宮崎県','鹿児島県','沖縄県'],

    // 研修種別
    'TRAINING_VARIATION' => ['carrerup'=>'キャリアアップ研修','general'=>'一般研修',],


];